In [ ]:
# 6.1 Reading and Writing Data in Text Format

In [7]:
import pandas as pd
import numpy as np

In [8]:
In [10]: !cat examples/ex1.csv

cat: examples/ex1.csv: No such file or directory

In [10]:
In [11]: df = pd.read_csv("examples/ex1.csv")

In [12]: df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [11]:
In [13]: !cat examples/ex2.csv

1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [12]:
In [14]: pd.read_csv("examples/ex2.csv", header=None)

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [13]:
In [15]: pd.read_csv("examples/ex2.csv", names=["a", "b", "c", "d", "message"])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [14]:
In [16]: names = ["a", "b", "c", "d", "message"]

In [17]: pd.read_csv("examples/ex2.csv", names=names, index_col="message")

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [17]:
In [18]: !cat examples/csv_mindex.csv

key1,key2,value1,value2
one,a,1,2
one,b,3,4
one,c,5,6
one,d,7,8
two,a,9,10
two,b,11,12
two,c,13,14
two,d,15,16

In [18]:
In [19]: parsed = pd.read_csv("examples/csv_mindex.csv",
   ....:                      index_col=["key1", "key2"])

In [20]: parsed

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [19]:
In [21]: !cat examples/ex3.txt

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [21]:
In [22]: result = pd.read_csv("examples/ex3.txt", sep="\\s+")

In [23]: result

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [22]:
In [24]: !cat examples/ex4.csv

# hey!
a,b,c,d,message
# just wanted to make things more difficult for you
# who reads CSV files with computers, anyway?
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [23]:
In [25]: pd.read_csv("examples/ex4.csv", skiprows=[0, 2, 3])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [24]:
In [26]: !cat examples/ex5.csv

something,a,b,c,d,message
one,1,2,3,4,NA
two,5,6,,8,world
three,9,10,11,12,foo

In [25]:
In [28]: result

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [26]:
In [29]: pd.isna(result)

         A      B      C
aaa  False  False  False
bbb  False  False  False
ccc  False  False  False
ddd  False  False  False

In [27]:
In [30]: result = pd.read_csv("examples/ex5.csv", na_values=["NULL"])

In [28]:
In [31]: result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [29]:
In [32]: result2 = pd.read_csv("examples/ex5.csv", keep_default_na=False)

In [33]: result2

  something  a   b   c   d message
0       one  1   2   3   4      NA
1       two  5   6       8   world
2     three  9  10  11  12     foo

In [30]:
In [34]: result2.isna()

   something      a      b      c      d  message
0      False  False  False  False  False    False
1      False  False  False  False  False    False
2      False  False  False  False  False    False

In [31]:
In [35]: result3 = pd.read_csv("examples/ex5.csv", keep_default_na=False,
   ....:                       na_values=["NA"])

In [36]: result3

  something  a   b   c   d message
0       one  1   2   3   4     NaN
1       two  5   6       8   world
2     three  9  10  11  12     foo

In [32]:
In [37]: result3.isna()

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False  False  False    False
2      False  False  False  False  False    False

In [33]:
In [38]: sentinels = {"message": ["foo", "NA"], "something": ["two"]}

In [39]: pd.read_csv("examples/ex5.csv", na_values=sentinels,
   ....:             keep_default_na=False)

  something  a   b   c   d message
0       one  1   2   3   4     NaN
1       NaN  5   6       8   world
2     three  9  10  11  12     NaN

In [34]:
In [34]: result2.isna()

   something      a      b      c      d  message
0      False  False  False  False  False    False
1      False  False  False  False  False    False
2      False  False  False  False  False    False

In [35]:
In [35]: result3 = pd.read_csv("examples/ex5.csv", keep_default_na=False,
   ....:                       na_values=["NA"])

In [36]:
In [36]: result3

  something  a   b   c   d message
0       one  1   2   3   4     NaN
1       two  5   6       8   world
2     three  9  10  11  12     foo

In [37]:
In [37]: result3.isna()

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False  False  False    False
2      False  False  False  False  False    False

In [38]:
In [38]: sentinels = {"message": ["foo", "NA"], "something": ["two"]}

In [39]: pd.read_csv("examples/ex5.csv", na_values=sentinels,
   ....:             keep_default_na=False)

  something  a   b   c   d message
0       one  1   2   3   4     NaN
1       NaN  5   6       8   world
2     three  9  10  11  12     NaN

In [39]:
In [40]: pd.options.display.max_rows = 10

In [40]:
In [41]: result = pd.read_csv("examples/ex6.csv")

In [42]: result

           one       two     three      four key
0     0.467976 -0.038649 -0.295344 -1.824726   L
1    -0.358893  1.404453  0.704965 -0.200638   B
2    -0.501840  0.659254 -0.421691 -0.057688   G
3     0.204886  1.074134  1.388361 -0.982404   R
4     0.354628 -0.133116  0.283763 -0.837063   Q
...        ...       ...       ...       ...  ..
9995  2.311896 -0.417070 -1.409599 -0.515821   L
9996 -0.479893 -0.650419  0.745152 -0.646038   E
9997  0.523331  0.787112  0.486066  1.093156   K
9998 -0.362559  0.598894 -1.843201  0.887292   G
9999 -0.096376 -1.012999 -0.657431 -0.573315   0

[10000 rows x 5 columns]

In [41]:
In [43]: pd.read_csv("examples/ex6.csv", nrows=5)

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q

In [43]:
In [44]: chunker = pd.read_csv("examples/ex6.csv", chunksize=1000)

In [45]: type(chunker)

pandas.io.parsers.readers.TextFileReader

In [44]:
chunker = pd.read_csv("examples/ex6.csv", chunksize=1000)

tot = pd.Series([], dtype='int64')
for piece in chunker:
    tot = tot.add(piece["key"].value_counts(), fill_value=0)

tot = tot.sort_values(ascending=False)

In [45]:
In [47]: tot[:10]

key
E    368.0
X    364.0
L    346.0
O    343.0
Q    340.0
M    338.0
J    337.0
F    335.0
K    334.0
H    330.0
dtype: float64

In [46]:
In [48]: data = pd.read_csv("examples/ex5.csv")

In [49]: data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [47]:
In [50]: data.to_csv("examples/out.csv")

In [51]:
In [51]: !cat examples/out.csv

,something,a,b,c,d,message
0,one,1,2,3.0,4,
1,two,5,6,,8,world
2,three,9,10,11.0,12,foo

In [52]:
In [52]: import sys

In [53]: data.to_csv(sys.stdout, sep="|")

|something|a|b|c|d|message
0|one|1|2|3.0|4|
1|two|5|6||8|world
2|three|9|10|11.0|12|foo

In [54]:
In [54]: data.to_csv(sys.stdout, na_rep="NULL")

,something,a,b,c,d,message
0,one,1,2,3.0,4,NULL
1,two,5,6,NULL,8,world
2,three,9,10,11.0,12,foo

In [55]:
In [52]: import sys

In [53]: data.to_csv(sys.stdout, sep="|")

|something|a|b|c|d|message
0|one|1|2|3.0|4|
1|two|5|6||8|world
2|three|9|10|11.0|12|foo

In [56]:
In [54]: data.to_csv(sys.stdout, na_rep="NULL")

,something,a,b,c,d,message
0,one,1,2,3.0,4,NULL
1,two,5,6,NULL,8,world
2,three,9,10,11.0,12,foo

In [57]:
In [55]: data.to_csv(sys.stdout, index=False, header=False)

one,1,2,3.0,4,
two,5,6,,8,world
three,9,10,11.0,12,foo

In [58]:
In [56]: data.to_csv(sys.stdout, index=False, columns=["a", "b", "c"])

a,b,c
1,2,3.0
5,6,
9,10,11.0

In [59]:
In [57]: !cat examples/ex7.csv

"a","b","c"
"1","2","3"
"1","2","3"

In [60]:
In [58]: import csv

In [59]: f = open("examples/ex7.csv")

In [60]: reader = csv.reader(f)

In [61]:
In [61]: for line in reader:
   ....:     print(line)

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3']

In [62]:
In [62]: f.close()

In [63]:
In [63]: with open("examples/ex7.csv") as f:
   ....:     lines = list(csv.reader(f))

In [64]:
In [64]: header, values = lines[0], lines[1:]

In [65]:
In [65]: data_dict = {h: v for h, v in zip(header, zip(*values))}

In [66]: data_dict

{'a': ('1', '1'), 'b': ('2', '2'), 'c': ('3', '3')}

In [81]:
class my_dialect(csv.Dialect):
    lineterminator = "\n"
    delimiter = ";"
    quotechar = '"'
    quoting = csv.QUOTE_MINIMAL

In [114]:
reader = csv.reader(f, dialect=my_dialect)

ValueError: I/O operation on closed file.

In [83]:
reader = csv.reader(f, delimiter="|")

ValueError: I/O operation on closed file.

In [84]:
with open("mydata.csv", "w") as f:
    writer = csv.writer(f, dialect=my_dialect)
    writer.writerow(("one", "two", "three"))
    writer.writerow(("1", "2", "3"))
    writer.writerow(("4", "5", "6"))
    writer.writerow(("7", "8", "9"))

In [85]:
obj = """
{"name": "Wes",
 "cities_lived": ["Akron", "Nashville", "New York", "San Francisco"],
 "pet": null,
 "siblings": [{"name": "Scott", "age": 34, "hobbies": ["guitars", "soccer"]},
              {"name": "Katie", "age": 42, "hobbies": ["diving", "art"]}]
}
"""

In [86]:
In [68]: import json

In [87]:
In [69]: result = json.loads(obj)

In [70]: result

{'name': 'Wes',
 'cities_lived': ['Akron', 'Nashville', 'New York', 'San Francisco'],
 'pet': None,
 'siblings': [{'name': 'Scott', 'age': 34, 'hobbies': ['guitars', 'soccer']},
  {'name': 'Katie', 'age': 42, 'hobbies': ['diving', 'art']}]}

In [88]:
In [71]: asjson = json.dumps(result)

In [72]: asjson

'{"name": "Wes", "cities_lived": ["Akron", "Nashville", "New York", "San Francisco"], "pet": null, "siblings": [{"name": "Scott", "age": 34, "hobbies": ["guitars", "soccer"]}, {"name": "Katie", "age": 42, "hobbies": ["diving", "art"]}]}'

In [89]:
In [73]: siblings = pd.DataFrame(result["siblings"], columns=["name", "age"])

In [74]: siblings

    name  age
0  Scott   34
1  Katie   42

In [90]:
In [75]: !cat examples/example.json

[{"a": 1, "b": 2, "c": 3},
 {"a": 4, "b": 5, "c": 6},
 {"a": 7, "b": 8, "c": 9}]

In [91]:
In [76]: data = pd.read_json("examples/example.json")

In [77]: data

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [94]:
In [78]: data.to_json(sys.stdout)

{"a":{"0":1,"1":4,"2":7},"b":{"0":2,"1":5,"2":8},"c":{"0":3,"1":6,"2":9}}

In [95]:
In [79]: data.to_json(sys.stdout, orient="records")

[{"a":1,"b":2,"c":3},{"a":4,"b":5,"c":6},{"a":7,"b":8,"c":9}]

In [97]:
pip install lxml

Collecting lxml
  Downloading lxml-5.3.0-cp312-cp312-macosx_10_9_universal2.whl.metadata (3.8 kB)
Downloading lxml-5.3.0-cp312-cp312-macosx_10_9_universal2.whl (8.2 MB)
    8.2/8.2 MB 14.8 MB/s eta 0:00:00a 0:00:01
Installing collected packages: lxml
Successfully installed lxml-5.3.0
Note: you may need to restart the kernel to use updated packages.

In [101]:
In [80]: tables = pd.read_html("examples/fdic_failed_bank_list.html")

In [81]: len(tables)

1

In [103]:
In [82]: failures = tables[0]

In [104]:
In [83]: failures.head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Allied Bank,Mulberry,AR,91,Today's Bank,"September 23, 2016","November 17, 2016"
1,The Woodbury Banking Company,Woodbury,GA,11297,United Bank,"August 19, 2016","November 17, 2016"
2,First CornerStone Bank,King of Prussia,PA,35312,First-Citizens Bank & Trust Company,"May 6, 2016","September 6, 2016"
3,Trust Company Bank,Memphis,TN,9956,The Bank of Fayette County,"April 29, 2016","September 6, 2016"
4,North Milwaukee State Bank,Milwaukee,WI,20364,First-Citizens Bank & Trust Company,"March 11, 2016","June 16, 2016"

In [110]:
In [84]: close_timestamps = pd.to_datetime(failures["Closing Date"])

In [85]: close_timestamps.dt.year.value_counts()

Closing Date
2010    157
2009    140
2011     92
2012     51
2008     25
       ...
2004      4
2001      4
2007      3
2003      3
2000      2
Name: count, Length: 15, dtype: int64

In [113]:
In [86]: from lxml import objectify

In [87]: path = "examples/Performance_MNR.xml"

In [88]: with open(path) as f:
            parsed = objectify.parse(f)

In [89]: root = parsed.getroot()

In [115]:
data = []

skip_fields = ["PARENT_SEQ", "INDICATOR_SEQ",
               "DESIRED_CHANGE", "DECIMAL_PLACES"]

for elt in root.INDICATOR:
    el_data = {}
    for child in elt.getchildren():
        if child.tag in skip_fields:
            continue
        el_data[child.tag] = child.pyval
    data.append(el_data)

In [116]:
In [91]: perf = pd.DataFrame(data)

In [92]: perf.head()

,AGENCY_NAME,INDICATOR_NAME,DESCRIPTION,PERIOD_YEAR,PERIOD_MONTH,CATEGORY,FREQUENCY,INDICATOR_UNIT,YTD_TARGET,YTD_ACTUAL,MONTHLY_TARGET,MONTHLY_ACTUAL
0,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,1,Service Indicators,M,%,95.0,96.9,95.0,96.9
1,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,2,Service Indicators,M,%,95.0,96.0,95.0,95.0
2,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,3,Service Indicators,M,%,95.0,96.3,95.0,96.9
3,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,4,Service Indicators,M,%,95.0,96.8,95.0,98.3
4,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,5,Service Indicators,M,%,95.0,96.6,95.0,95.8

In [117]:
In [93]: perf2 = pd.read_xml(path)

In [94]: perf2.head()

,INDICATOR_SEQ,PARENT_SEQ,AGENCY_NAME,INDICATOR_NAME,DESCRIPTION,PERIOD_YEAR,PERIOD_MONTH,CATEGORY,FREQUENCY,DESIRED_CHANGE,INDICATOR_UNIT,DECIMAL_PLACES,YTD_TARGET,YTD_ACTUAL,MONTHLY_TARGET,MONTHLY_ACTUAL
0,28445,NaN,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,1,Service Indicators,M,U,%,1,95.00,96.90,95.00,96.90
1,28445,NaN,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,2,Service Indicators,M,U,%,1,95.00,96.00,95.00,95.00
2,28445,NaN,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,3,Service Indicators,M,U,%,1,95.00,96.30,95.00,96.90
3,28445,NaN,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,4,Service Indicators,M,U,%,1,95.00,96.80,95.00,98.30
4,28445,NaN,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at thei...,2008,5,Service Indicators,M,U,%,1,95.00,96.60,95.00,95.80

In [ ]:
# 6.2 Binary Data Formats

In [135]:
In [95]: frame = pd.read_csv("examples/ex1.csv")

In [96]: frame

frame.to_pickle("examples/frame_pickle")

In [136]:
In [98]: pd.read_pickle("examples/frame_pickle")

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [155]:
In [99]: !rm examples/frame_pickle

rm: examples/frame_pickle: No such file or directory

In [156]:
pip install fastparquet

Requirement already satisfied: fastparquet in /Users/sjahan/Library/jupyterlab-desktop/jlab_server/lib/python3.12/site-packages (2024.11.0)
Requirement already satisfied: pandas>=1.5.0 in /Users/sjahan/Library/jupyterlab-desktop/jlab_server/lib/python3.12/site-packages (from fastparquet) (2.2.2)
Requirement already satisfied: numpy in /Users/sjahan/Library/jupyterlab-desktop/jlab_server/lib/python3.12/site-packages (from fastparquet) (2.1.0)
Requirement already satisfied: cramjam>=2.3 in /Users/sjahan/Library/jupyterlab-desktop/jlab_server/lib/python3.12/site-packages (from fastparquet) (2.9.0)
Requirement already satisfied: fsspec in /Users/sjahan/Library/jupyterlab-desktop/jlab_server/lib/python3.12/site-packages (from fastparquet) (2024.10.0)
Requirement already satisfied: packaging in /Users/sjahan/Library/jupyterlab-desktop/jlab_server/lib/python3.12/site-packages (from fastparquet) (24.1)
Requirement already satisfied: python-dateutil>=2.8.2 in /Users/sjahan/Library/jupyterlab-desktop/jlab_server/lib/python3.12/site-packages (from pandas>=1.5.0->fastparquet) (2.9.0)
Requirement already satisfied: pytz>=2020.1 in /Users/sjahan/Library/jupyterlab-desktop/jlab_server/lib/python3.12/site-packages (from pandas>=1.5.0->fastparquet) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in /Users/sjahan/Library/jupyterlab-desktop/jlab_server/lib/python3.12/site-packages (from pandas>=1.5.0->fastparquet) (2024.1)
Requirement already satisfied: six>=1.5 in /Users/sjahan/Library/jupyterlab-desktop/jlab_server/lib/python3.12/site-packages (from python-dateutil>=2.8.2->pandas>=1.5.0->fastparquet) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [157]:
In [100]: dec = pd.read_parquet('examples/fec.parquet')

In [158]:
pip install openpyxl

Requirement already satisfied: openpyxl in /Users/sjahan/Library/jupyterlab-desktop/jlab_server/lib/python3.12/site-packages (3.1.5)
Requirement already satisfied: et-xmlfile in /Users/sjahan/Library/jupyterlab-desktop/jlab_server/lib/python3.12/site-packages (from openpyxl) (2.0.0)
Note: you may need to restart the kernel to use updated packages.

In [159]:
In [101]: xlsx = pd.ExcelFile("examples/ex1.xlsx")

In [160]:
In [102]: xlsx.sheet_names

['Sheet1']

In [161]:
In [103]: xlsx.parse(sheet_name="Sheet1")

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [162]:
In [104]: xlsx.parse(sheet_name="Sheet1", index_col=0)

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [163]:
In [105]: frame = pd.read_excel("examples/ex1.xlsx", sheet_name="Sheet1")

In [106]: frame

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [164]:
In [107]: writer = pd.ExcelWriter("examples/ex2.xlsx")

In [108]: frame.to_excel(writer, "Sheet1")

In [109]: writer.close()

/var/folders/nf/zm9hb0654b163bnmw_ts6bwh0000gp/T/ipykernel_97536/1966862569.py:3: FutureWarning: Starting with pandas version 3.0 all arguments of to_excel except for the argument 'excel_writer' will be keyword-only.
  frame.to_excel(writer, "Sheet1")

In [165]:
In [110]: frame.to_excel("examples/ex2.xlsx")

In [166]:
!rm -f examples/mydata.h5

In [167]:
conda install pytables

Channels:
 - defaults
 - conda-forge
Platform: osx-arm64
Collecting package metadata (repodata.json): done
Solving environment: / warning  libmamba Added empty dependency for problem type SOLVER_RULE_UPDATE
failed

LibMambaUnsatisfiableError: Encountered problems while solving:
  - package pytables-3.9.2-py312h905a39b_0 requires numpy >=1.26.3,<2.0a0, but none of the providers can be installed

Could not solve for environment specs
The following packages are incompatible
 libzlib is installable and it requires
   zlib 1.3.1 *_1, which can be installed;
 numpy 2.1.0.*  is requested and can be installed;
 pin-1 is installable and it requires
   python 3.12.* , which can be installed;
 pytables is not installable because there are no viable options
    pytables [3.10.1|3.8.0|3.9.2] would require
      python >=3.10,<3.11.0a0 , which conflicts with any installable versions previously reported;
    pytables [3.10.1|3.8.0|3.9.2] would require
      python >=3.11,<3.12.0a0 , which conflicts with any installable versions previously reported;
    pytables 3.10.1 would require
      numpy >=1.26.4,<2.0a0 , which conflicts with any installable versions previously reported;
    pytables [3.6.1|3.7.0] would require
      zlib, which conflicts with any installable versions previously reported;
    pytables 3.8.0 would require
      python >=3.8,<3.9.0a0 , which conflicts with any installable versions previously reported;
    pytables [3.8.0|3.9.2] would require
      python >=3.9,<3.10.0a0 , which conflicts with any installable versions previously reported;
    pytables 3.9.2 would require
       numpy >=1.26.3,<2.0a0 , which conflicts with any installable versions previously reported.


Note: you may need to restart the kernel to use updated packages.

In [171]:
In [113]: frame = pd.DataFrame({"a": np.random.standard_normal(100)})

In [114]: store = pd.HDFStore("examples/mydata.h5")

In [115]: store["obj1"] = frame

In [116]: store["obj1_col"] = frame["a"]

In [117]: store

ImportError: Missing optional dependency 'pytables'.  Use pip or conda to install pytables.

In [ ]:
In [118]: store["obj1"]

In [ ]:
In [119]: store.put("obj2", frame, format="table")

In [120]: store.select("obj2", where=["index >= 10 and index <= 15"])

In [121]: store.close()

In [ ]:
In [122]: frame.to_hdf("examples/mydata.h5", "obj3", format="table")

In [123]: pd.read_hdf("examples/mydata.h5", "obj3", where=["index < 5"])

In [176]:
In [124]: import os

In [125]: os.remove("examples/mydata.h5")

FileNotFoundError: [Errno 2] No such file or directory: 'examples/mydata.h5'

In [177]:
In [126]: import requests

In [127]: url = "https://api.github.com/repos/pandas-dev/pandas/issues"

In [128]: resp = requests.get(url)

In [129]: resp.raise_for_status()

In [130]: resp

In [178]:
In [131]: data = resp.json()

In [132]: data[0]["title"]

'DOC: Fix docstrings errors SEM and GET_GROUP'

In [179]:
In [133]: issues = pd.DataFrame(data, columns=["number", "title",
   .....:                                      "labels", "state"])

In [134]: issues

,number,title,labels,state
0,60475,DOC: Fix docstrings errors SEM and GET_GROUP,[],open
1,60474,DOC: DataFrameGroupBy.idxmin() returns DataFra...,"[{'id': 134699, 'node_id': 'MDU6TGFiZWwxMzQ2OT...",open
2,60473,BUG: Preserve Timezone and Higher Resolution i...,[],open
3,60472,"ENH: ""forward rolling"" - where instead of look...","[{'id': 76812, 'node_id': 'MDU6TGFiZWw3NjgxMg=...",open
4,60471,BUG: DataFrameGroupBy.apply ignores group_keys...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
...,...,...,...,...
25,60428,ENH: Add a safe Option to hash_pandas_object ...,"[{'id': 76812, 'node_id': 'MDU6TGFiZWw3NjgxMg=...",open
26,60427,BUG: combine_first reorders columns,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
27,60423,BUG: `csv.QUOTE_NOTNULL` doesn't seem to be su...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
28,60422,ENH: Add table prefixes to to_sql method,"[{'id': 76812, 'node_id': 'MDU6TGFiZWw3NjgxMg=...",open
29,60409,ENH: Add table prefixes to to_sql method,"[{'id': 47232590, 'node_id': 'MDU6TGFiZWw0NzIz...",open

In [ ]:
# 6.4 Interacting with Databases

In [181]:
In [135]: import sqlite3

In [136]: query = """
   .....: CREATE TABLE test
   .....: (a VARCHAR(20), b VARCHAR(20),
   .....:  c REAL,        d INTEGER
   .....: );"""

In [137]: con = sqlite3.connect("mydata.sqlite")

In [138]: con.execute(query)

In [182]:
In [139]: con.commit()

In [183]:
In [140]: data = [("Atlanta", "Georgia", 1.25, 6),
   .....:         ("Tallahassee", "Florida", 2.6, 3),
   .....:         ("Sacramento", "California", 1.7, 5)]

In [141]: stmt = "INSERT INTO test VALUES(?, ?, ?, ?)"

In [142]: con.executemany(stmt, data)

In [184]:
In [143]: con.commit()

In [185]:
In [144]: cursor = con.execute("SELECT * FROM test")

In [145]: rows = cursor.fetchall()

In [146]: rows

[('Atlanta', 'Georgia', 1.25, 6),
 ('Tallahassee', 'Florida', 2.6, 3),
 ('Sacramento', 'California', 1.7, 5)]

In [186]:
In [147]: cursor.description

(('a', None, None, None, None, None, None),
 ('b', None, None, None, None, None, None),
 ('c', None, None, None, None, None, None),
 ('d', None, None, None, None, None, None))

In [187]:
In [148]: pd.DataFrame(rows, columns=[x[0] for x in cursor.description])

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5

In [190]:
conda install sqlalchemy as sqla

Channels:
 - defaults
 - conda-forge
Platform: osx-arm64
Collecting package metadata (repodata.json): done
Solving environment: failed

PackagesNotFoundError: The following packages are not available from current channels:

  - sqla
  - as

Current channels:

  - defaults
  - https://conda.anaconda.org/conda-forge/noarch

To search for alternate channels that may provide the conda package you're
looking for, navigate to

    https://anaconda.org

and use the search bar at the top of the page.



Note: you may need to restart the kernel to use updated packages.

In [193]:
In [150]: db = sqla.create_engine("sqlite:///mydata.sqlite")

In [151]: pd.read_sql("SELECT * FROM test", db)

NameError: name 'sqla' is not defined

In [194]:
!rm mydata.sqlite